content-org/timeSeries.org
#+TITLE: Time Series
#+hugo_base_dir: ~/blog/
#+hugo_section: posts
#+hugo_front_matter_format: yaml

** DONE Time Series Analysis Basic Plots, Examples, and Fundamental Concepts
CLOSED: [2022-03-15 Tue 18:23]
:PROPERTIES:
:EXPORT_FILE_NAME: timeSeriesAnalysisWeek1
:EXPORT_OPTIONS: author:nil
:END:
*** Introduction
You will study the basic context of time series and stochastic processes including basic visualisations for time series data.

Time series data is composed of observations collected sequentially over time. This type of data is frequently seen and analysed in data analytics applications.

In *business*, we observe
+ weekly interest rates,
+ daily closing stock prices,
+ monthly price indices,
+ yearly sales figures, and so forth.

In *meteorology*, we observe

+ daily high and low temperatures,
+ annual precipitation and drought indices, and
+ hourly wind speeds.

In *agriculture*, we record

+ annual figures for crop and livestock production,
+ soil erosion, and export sales.

In the *biological* sciences, we observe the electrical activity of the heart at millisecond intervals.

In *ecology*, we record the abundance of an animal species.

As a recent example from time series research, Miwa Fukino, Yoshito Hirata, and Kazuyuki Aihara from University of Tokyo proposed a new method based on nonlinear time series analysis analyse music’s emotional effect.

In this module,

we will start with examples of time series and visualise time series data with the most frequently used plots.
Introduce the model-building strategy that we will follow through the semester.
We will focus on the fundamental concepts in terms of
Time Series and Stochastic Processes,
Means, Variances, and Covariances, and Stationarity.

*** Examples of time series
In this section, we will see some examples of time series and basic visualisations to make inferences about the basic characteristics of time series data. In all of the examples, we use the R package TSA. Therefore you need to install the TSA packages calling

#+begin_src R
install.packages("TSA")
#+end_src
*** Annual Rainfall in Los Angeles
In this example, the data is composed of the annual rainfall amounts recorded in Los Angeles, California, over more than 100 years. The time series plot for this data is generated with the following code chunk. Here, the dataset larain contains the annual rainfall data. Please note that throughout the codes given in this module, you can also use win.graph() function to open a new graphics window with the settings determined by the arguments of this function.

#+begin_src R
library(TSA)
# win.graph(width=4.875, height=2.5,pointsize=8)
data(larain)
plot(larain,ylab='Inches',xlab='Year',type='o', main = "Figure 1. Time series plot of LA rain series.")
#+end_src

In Figure 1, we observe considerable variation in rainfall amount over the years from this time series plot. The year 1883 was an exceptionally wet year for Los Angeles, while 1983 was quite dry. For the analysis, we are interested in whether or not consecutive years are related in some way. If so, we might be able to use one year’s rainfall value to help forecast next year’s rainfall amount. The following code chunk generates a scatter plot to investigate the relationship between pairs of consecutive rainfall values:

#+begin_src R
plot(y=larain,x=zlag(larain),ylab='Inches', xlab='Previous Year Inches', main = "Figure 2. Scatter plot of rainfall in consequtive years.")
#+end_src

The plots show no “trends” and no general tendencies. In Figure 2, the point plotted near the lower right-hand corner shows that the year of extremely high rainfall, 40 inches in 1883, was followed by an amount nearly 12 inches in 1884. The point near the top of the display shows that the 40-inch year was preceded by a much more typical year of about 15 inches. We observe from this plot that there is little information about this year’s rainfall amount from last year’s amount. The correlation between last year’s rainfall amount and this year’s amount which can be calculated by the following code chunk:

#+begin_src R
y = larain             # Read the annual rainfall data into y
x = zlag(larain)       # Generate first lag of the annual rainfall series
index = 2:length(x)    # Create an index to get rid of the first NA value in x
cor(y[index],x[index]) # Calculate correlation between numerical values in x and y
#+end_src
*** An Industrial Chemical Process
The second example is on a a time series from an industrial chemical process. A color property from consecutive batches in the process is measured here and named color in the package. We plot the time series with the following code chunk:

#+begin_src R
# win.graph(width=4.875, height=2.5,pointsize=8)
data(color)
plot(color,ylab='Color Property',xlab='Batch',type='o', main = "Figure 3. Time series plot of the color property series.")
#+end_src
From Figure 3, it seems that succeeding measurements are related to one another as the values that are neighbors in time tend to be similar in size. This is more clearly seen in the following scatter plot of neighboring pairs:

#+begin_src R
# win.graph(width=3,height=3,pointsize=8)
plot(y=color,x=zlag(color),ylab='Color Property', xlab='Previous Batch Color Property', main = "Figure 4. Scatter plot of the color property in consequtive batches.")
#+end_src

In Figure 4, we see a slight upward trend, which is apparent but not terribly strong. The correlation in this scatter plot is about 0.6:

#+begin_src R
y = color              # Read the color data into y
x = zlag(color)        # Generate first lag of the color series
index = 2:length(x)    # Create an index to get rid of the first NA value in x
cor(y[index],x[index]) # Calculate correlation between numerical values in x and y
#+end_src
*** Annual Abundance of Canadian Hare
The third example concerns the annual abundance of Canadian hare. The data consists of their abundance over about 30 years. The following is the time series plot of annual abundance of Canadian hare for 30 years:

#+begin_src R
# win.graph(width=4.875, height=2.5,pointsize=8)
data(hare)
plot(hare,ylab='Abundance',xlab='Year',type='o', main = "Figure 5. Time series plot of annual abundance of Canadian hare.")
#+end_src

In Figure 5, neighboring values here are very closely related. Large changes in abundance do not occur from one year to the next. The following plot shows the correlation between abundance versus the previous year’s abundance:

#+begin_src R
# win.graph(width=3, height=3,pointsize=8)
plot(y=hare,x=zlag(hare),ylab='Abundance', xlab='Previous Year Abundance', main = "Figure 6. Scatter plot of abundance in consequtive years.")
#+end_src

In Figure 6, we see an upward trend in the plot-low values tend to be followed by low values in the next year, middle-sized values by middle-sized values, and high values by high values. The amount of correlation between neighboring abundance values is 0.70:

#+begin_src R
y = hare               # Read the abundance data into y
x = zlag(hare)         # Generate first lag of the abundance series
index = 2:length(x)    # Create an index to get rid of the first NA value in x
cor(y[index],x[index]) # Calculate correlation between numerical values in x and y
#+end_src
