content/posts/timeSeriesAnalysisWeek1.md


## Means, Variances, and Covariances {#means-variances-and-covariances}

For a stochastic process {<t=0,±1,±2,±3>,…}, the mean function is defined by

μt=E(Yt), for t=0,±1,±2,±3,…

Actually, μt is just the expected value of the process at time t.

The autocovariance function, γt,s is defined as

γt,s=Cov(Yt,Ys), for t,s=0,±1,±2,±3,…

where Cov(Yt,Ys)=E[(Yt−μt)(Ys−μs)]=E(YtYs)−μtμs.

The autocorrelation function, ρt,s, is given by

ρt,s=Corr(Yt,Ys), for t,s=0,±1,±2,±3,…

where

Corr(Yt,Ys)=Cov(Yt,Ys)Var(Yt)Var(Ys)−−−−−−−−−−−−−√=γt,sγt,tγs,s−−−−−√.

Please note that

γt,t=Cov(Yt,Yt)=E[(Yt−μt)(Yt−μt)]=E[(Yt−μt)2]=E(Y2t)−μ2t=Var(Yt)

and

γs,s=Cov(Ys,Ys)=E[(Ys−μs)(Ys−μs)]=E[(Ys−μs)2]=E(Y2s)−μ2s=Var(Ys).

Consequently, ρt,t=ρs,s=1.

Because γt,s=γs,t, we have ρt,s=ρs,t. And because |γt,s|≤γt,tγs,s−−−−−√, we have |ρt,s|≤1.

Values of ρt,s near ±1 indicate strong (linear) dependence, whereas values near zero indicate weak (linear) dependence. If ρt,s=0, we say that Yt and Ys are uncorrelated.

Because most of the context is based on the covariance and correlations, we will go a little bit further. To investigate the covariance properties of various time series models, the following result will be used repeatedly: If c1,c2,…,cm and d1,d2,…,dn are constants and t1,t2,…,tm and s1,s2,…,sn are time points, then the contrivance of two linear combinations of time series observations is calculated by

Cov[∑i=1mciYti,∑j=1ndjYsj]=∑i=1m∑j=1ncidjCov(Yti,Ysj).

As a special case, we obtain the variance of a linear combination of time series observations as

Var[∑i=1mciYti]=∑i=1nc2iVar(Yti)+2∑i&lt;jcicjCov(Yti,Ytj).


## The Random Walk {#the-random-walk}

Let e1,e2,… be a sequence of independent, identically distributed random variables each with zero mean and variance σ2e. The observed time series, {<t=1,2>,…}, is constructed as follows:

Y1Y2Yt==⋮=e1e1+e2e1+e2+⋯+et

Apparently, this system of equations can be written as

Yt=Yt−1+et

with initial condition Y1=e1.

If the e’s are interpreted as the sizes of the “steps” taken (forward or backward) along a number line, then Yt is the position of the random walker at time t.

We obtain the mean and variance of the random walk process as follows:

μt=E(Yt)=E(e1+e2+⋯+et)=E(e1)+E(e2)+⋯+E(et)=0+0+⋯+0.

So, μt=0 for all t. As for the variance,

Var(Yt)=Var(e1+e2+⋯+et)=Var(e1)+Var(e2)+⋯+Var(et)=σ2e+σ2e+⋯+σ2e.

So we have a linearly increasing variance Var(Yt)=tσ2e with time.

For 1≤t≤s, we have the following autocorrelation function,

γt,s=tσ2e.

Autocorrelation function is straightforwardly obtained as follows:

ρt,s=ts−−√

for 1≤t≤s. For example, we have the following autocorrelation values ρ1,2=0.707, ρ8,9=0.943, ρ24,25=0.980, and ρ1,25=0.200. The neighboring time points are more correlated than those distant from each other.

Figure 12 shows a simulated random walk:

```R
data(rwalk) # rwalk contains a simulated random walk
plot(rwalk,type='o',ylab='Random Walk', main = "Figure 12. Time series plot of a simulated random walk.")
```


## A Moving Average {#a-moving-average}

Suppose that {Yt} is constructed as

Yt=et+et−12

where e’s are i.i.d. with zero mean and variance σ2e. Consequently, we have the following:

μt=0Var(Yt)=0.5σ2eCov(Yt,Yt−1)=0.25σ2e and Cov(Yt,Yt−k)=0 for k&gt;1, and ρt,s=0.5 and ρt,t−k=0 for k&gt;1.

Values of Y precisely one-time unit apart have exactly the same correlation no matter where they occur in time and, more generally, ρt,t−k is the same for all values of t. This leads us to the important concept of stationarity.

The following code chunk generates a random realisation of a moving average series in Figure 13.

```R
e = rnorm(50,0,1) # Generate standard normal distributed e_t series
Y = array(NA, 50)
for ( t in 2:50){
  Y[t] = (e[t] + e[t-1])/2
}
plot(ts(Y), type ="o", ylab="Y_t", xlab ="t", main = "Figure 13. Time series plot of a moving average series.")
```


## Stationarity {#stationarity}

The basic idea of stationarity is that the probability laws that govern the behavior of the process do not change over time. the assumption of stationarity allows us to make statistical inferences about the structure of a stochastic process on the basis of an observed record of that process. Specifically, a process {Yt} is said to be strictly stationary if the joint distribution of Yt1,Yt2,…,Ytn is the same as the joint distribution of Yt1−k,Yt2−k,…,Ytn−k for all choices of time points t1,t2,…,tn and all choices of time lag k.

It then follows that both the mean and variance functions are constant for all time: E(Yt)=E(Yt−k) and Var(Yt)=Var(Yt−k) for all t and k.

The covariance between Yt and Ys depends on time only through the time difference |t−s| and not otherwise on the actual times t and s.

Thus, for a stationary process, to simplify our notation, we can write

γk=Cov(Yt,Yt−k) and ρk=Corr(Yt,Yt−k)=γkγ0.

General properties of a stationary process are

γ0=Var(Yt)γk=γ−k|γk|≤γ0

and correspondingly,

ρ0=1ρk=ρ−k|ρk|≤1.

If a process is strictly stationary and has a finite variance, then the covariance function must depend only on the time lag. A definition that is similar to that of strict stationarity but is mathematically weaker is the following: A stochastic process {Yt} is said to be weakly (or second-order) stationary if

The mean function is constant over time, and
γt,t−k=γ0,k for all time t and lag k.
In this course, the term stationary when used alone will always refer to this weaker form of stationarity.

Figure 14 and 15 show a stationary and a nonstationary randomly generated series. Which one is for the non-stationary series?


## White Noise {#white-noise}

One of the important and mostly used stationary processes is called white noise process. A white noise process is actually a sequence of i.i.d. random variables {et}. many useful processes can be constructed from white noise.

For a white noise process, μt=E(et) is constant and γk=Var(et) for k=0 and γk=0 for k≠0. Thus, we can write ρk=1 for k=0 and ρk=0 for k≠0. We usually assume that the white noise process has mean zero and denote Var(et) by σ2e.

The moving average also defines a stationary process. For a moving average process, Yt=(et+et−1)/2, we have ρk=1 for k=0, ρk=0.5 for |k|=1, and ρk=0 for |k|≥2.

Figure 16 shows an example of a white noise series:

```R
e = rnorm(50,0,1)
plot(ts(e), type ="o", ylab="e_t", xlab ="t", main = "Figure 16. Time series plot of a white noise series.")
```


## Random Cosine Wave {#random-cosine-wave}

Let us define the following process:

Yt=cos[2π(t12+Φ)] for t=0,±1,±2,…

where Φ∼Uniform(0,1). Figure 17 displays the time series plot of this process:

```R
phi = runif(51,0,1)
t = seq(0,50,1)
Y = cos(2*pi*((t/12)+phi))
plot(ts(Y), type ="o", ylab="Y_t", xlab ="t", main = "Figure 17. Time series plot of a random cosine wave.")
```

Statistical properties of this process are

E(Yt)=∫10cos[2π(t12+ϕ)]f(ϕ)dϕ=∫10cos[2π(t12+ϕ)]⋅1dϕ=12πsin(2πt12+ϕ)∣∣∣10=12π[sin(2πt12+2π)−sin(2πt12)]=0

for all t. Also,

γt,s=12cos[2π(|t−s|12)].

So the process is stationary with the autocorrelation function

ρk=cos(2πk12) for t=0,±1,±2,…

With this example, we observe that it will be difficult to assess whether or not stationarity is a reasonable assumption for a given time series on the basis of the time sequence plot of the observed data.

As another example, the random walk constructed with Yt=e1+e2+⋯+et is not stationary due to non-constant variance function Var(Yt=tσ2e also its covariance function γt,s=tσ2e does not depend only on time lag for 0≤t&lt;s.

Instead of going on with Yt directly, we can consider the differences of successive Y-values, denoted ΔYt. Then $Y<sub>t</sub> = Y<sub>t</sub>-Y<sub>t−1</sub>=e<sub>t</sub>, so the differenced series, {ΔYt}, is stationary.

Many real time series cannot be reasonably modeled by stationary processes since they are not in statistical- equilibrium but are evolving over time. However, we can frequently transform non- stationary series into stationary series by simple techniques such as differencing.
